server/tests/load/load-test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: 'Ramp up'
    - duration: 120
      arrivalRate: 20
      name: 'Sustain load'
    - duration: 60
      arrivalRate: 5
      name: 'Ramp down'
  processor: './load-test-processor.js'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  http:
    timeout: 30
  ensure:
    p95: 500
    p99: 1000

scenarios:
  - name: 'Authentication Flow'
    weight: 10
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: 'load-test@uta.edu.ec'
            password: 'LoadTest123!'
          expect:
            - statusCode: 200
          capture:
            - json: '$.accessToken'
              as: 'token'
      - get:
          url: '/api/users/me'
          headers:
            Authorization: 'Bearer {{ token }}'
          expect:
            - statusCode: 200

  - name: 'Get Trips List'
    weight: 40
    beforeScenario: 'loginAndGetToken'
    flow:
      - get:
          url: '/api/trips?page=1&limit=20'
          headers:
            Authorization: 'Bearer {{ token }}'
          expect:
            - statusCode: 200

  - name: 'Search Trips with Filters'
    weight: 30
    beforeScenario: 'loginAndGetToken'
    flow:
      - get:
          url: '/api/trips?destinationZone=Campus&limit=20'
          headers:
            Authorization: 'Bearer {{ token }}'
          expect:
            - statusCode: 200

  - name: 'Get User Profile'
    weight: 10
    beforeScenario: 'loginAndGetToken'
    flow:
      - get:
          url: '/api/users/me'
          headers:
            Authorization: 'Bearer {{ token }}'
          expect:
            - statusCode: 200

  - name: 'Get Trip Detail'
    weight: 10
    beforeScenario: 'loginAndGetToken'
    flow:
      - get:
          url: '/api/trips?page=1&limit=1'
          headers:
            Authorization: 'Bearer {{ token }}'
          expect:
            - statusCode: 200
          capture:
            - json: '$.trips[0].id'
              as: 'tripId'
      - get:
          url: '/api/trips/{{ tripId }}'
          headers:
            Authorization: 'Bearer {{ token }}'
          ifTrue: 'tripId'
          expect:
            - statusCode: [200, 404]